Autodesk.Revit.DB.IFC.IExporterIFC.ExportIFC(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.View)
The method that Revit will invoke to perform an export to IFC.
Remarks:
There will be a transaction group opened for the document.  Any changes made to the document
must be temporary, as the transaction group will automatically be rolled back at the end.
document:
The document to export.
exporter:
The IFC exporter object.
filterView:
The view whose filter visibility settings govern the export.
Since:
2012

Autodesk.Revit.DB.IFC.IExporterIFC
The interface used to implement a custom IFC exporter.
Remarks:
Implement this interface and register an instance of the derived class with ExporterIFCRegistry.
Since:
2012